In [5]:
import pandas as pd

In [6]:
a = pd.DataFrame({"Name":["Abir","Trijal","Kanishka"],"Gender":["M","M","M"],"Age":[21,22,23]})
print(a)

       Name Gender  Age
0      Abir      M   21
1    Trijal      M   22
2  Kanishka      M   23

In [7]:
a[["Name"]]

       Name
0      Abir
1    Trijal
2  Kanishka

In [8]:
a["Name"]

0        Abir
1      Trijal
2    Kanishka
Name: Name, dtype: object

In [9]:
a[["Name","Age"]]

       Name  Age
0      Abir   21
1    Trijal   22
2  Kanishka   23

In [17]:
a["Class"]:["UK","UK","UK"]
print(a)

       Name Gender  Age class State
0      Abir      M   21    UK    AS
1    Trijal      M   22    UK    WB
2  Kanishka      M   23    UK    PB

In [25]:
a["State"]=["AS","WB","PB"]
print(a)

       Name Friends Gender  Age class State
0      Abir     Yes      M   21    UK    AS
1    Trijal     Yes      M   22    UK    WB
2  Kanishka     Yes      M   23    UK    PB

In [36]:
a.insert(2, "CGPA", [10, 10, 10])

ValueError: cannot insert CGPA, already exists

In [37]:
print(a)

       Name  CGPA Friends Gender  Age class State
0      Abir    10     Yes      M   21    UK    AS
1    Trijal    10     Yes      M   22    UK    WB
2  Kanishka    10     Yes      M   23    UK    PB

In [38]:
a.dtypes

Name       object
CGPA        int64
Friends    object
Gender     object
Age         int64
class      object
State      object
dtype: object

In [45]:
a.keys()

Index(['Name', 'CGPA', 'Friends', 'Gender', 'Age', 'class', 'State'], dtype='object')

In [48]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [49]:
a.columns

Index(['Name', 'CGPA', 'Friends', 'Gender', 'Age', 'class', 'State'], dtype='object')

In [50]:
a["Kuch Bhi"]=["ese","wese","kese"]
print(a)

       Name  CGPA Friends Gender  Age class State Kuch Bhi
0      Abir    10     Yes      M   21    UK    AS      ese
1    Trijal    10     Yes      M   22    UK    WB     wese
2  Kanishka    10     Yes      M   23    UK    PB     kese

In [51]:
a.pop("Kuch Bhi")

0     ese
1    wese
2    kese
Name: Kuch Bhi, dtype: object

In [52]:
print(a)

       Name  CGPA Friends Gender  Age class State
0      Abir    10     Yes      M   21    UK    AS
1    Trijal    10     Yes      M   22    UK    WB
2  Kanishka    10     Yes      M   23    UK    PB